{
  "nav": {
    "about": "About",
    "stack": "Tech Stack",
    "projects": "Projects",
    "certificates": "Certificates",
    "prices": "Prices",
    "contacts": "Contacts"
  },
  "bio": {
    "title": "About Me",
    "description": "Backend developer from Russia with 1+ year of commercial experience in building Telegram bots, web apps, and fullstack solutions. Skilled in Python (FastAPI, aiogram), JavaScript/TypeScript (Node.js, Express, Nest, React, Vue), Docker, Redis, and Postgres. Passionate about clean code and retro pixel art."
  },
  "arch": {
    "title": "Arch Linux",
    "description": "I use Arch, btw. My go-to OS for development."
  },
  "docker": {
    "title": "Docker",
    "description": "Every freelance web developer needs some DevOps skills. I use Docker for containerization."
  },
  "eth": {
    "title": "Ethereum",
    "description": "Worked with Ethereum libraries, particularly web3.js."
  },
  "express": {
    "title": "Express",
    "description": "Perfect for small applications like Telegram Mini Apps."
  },
  "fastapi": {
    "title": "FastAPI",
    "description": "The most convenient and clear tool for building APIs."
  },
  "git": {
    "title": "Git",
    "description": "As sacred as Linux. Essential for version control."
  },
  "js": {
    "title": "JavaScript",
    "description": "Second (and last) after Python in my stack."
  },
  "nest": {
    "title": "NestJS",
    "description": "For serious developers building robust applications."
  },
  "node": {
    "title": "Node.js",
    "description": "The cradle for JavaScript and TypeScript development."
  },
  "npm": {
    "title": "npm",
    "description": "A bit cumbersome but reliable package manager."
  },
  "postgres": {
    "title": "PostgreSQL",
    "description": "The ultimate database for all my projects."
  },
  "python": {
    "title": "Python",
    "description": "My top language with over 2 years of experience."
  },
  "react": {
    "title": "React",
    "description": "Like a jet engine for building awesome interfaces."
  },
  "redis": {
    "title": "Redis",
    "description": "Used for caching, small tasks, and even as a lightweight database."
  },
  "telegram": {
    "title": "Telegram API",
    "description": "I build bots and Telegram Mini Apps, working extensively with the Telegram API."
  },
  "tensorflow": {
    "title": "TensorFlow",
    "description": "The future of IT with machine learning capabilities."
  },
  "ton": {
    "title": "TON",
    "description": "The future of blockchain technology."
  },
  "ts": {
    "title": "TypeScript",
    "description": "A sane version of JavaScript."
  },
  "vue": {
    "title": "Vue",
    "description": "Just Vue — simple and powerful."
  },
  "svara": {
    "title": "SvaraPro",
    "description": "Разработал полнофункциональную карточную игру в формате Telegram Mini App для 6 игроков с системой ставок в криптовалюте (TON, USDT). Реализована сложная игровая логика, реальное время через WebSockets, реферальная система для привлечения пользователей. Бэкенд обеспечивает высокую производительность и отказоустойчивость благодаря микросервисной архитектуре на Nest.js, PostgreSQL и Redis."
  },
  "trader": {
    "title": "Ruble Trader Game",
    "description": "Создал игровой симулятор биржевой торговли в виде Telegram Mini App. Пользователи могут торговать с небольшими депозитами, участвовать в лидербордах и фармить игровые токены за активность. Ключевой особенностью является интеграция TonConnect для безопасных крипто-транзакций. Архитектура проекта включает Vue.js на фронтенде, высоконагруженный бэкенд на Nest.js и постоянное соединение для обновления котировок через WebSockets."
  },
  "caller": {
    "title": "Crypto Caller",
    "description": "Реализовал сервис оповещений о достижении ценовых уровней на крипторынке через телефонные звонки с использованием Twilio. Пользователи устанавливают целевые цены для токенов, и система автоматически инициирует звонок при их достижении. Проект включает систему подписок, интеграцию с биржами и надежный бэкенд для обработки большого количества ценовых данных в реальном времени."
  },
  "ruble": {
    "title": "Ruble Coin Landing",
    "description": "Разработал и внедрил высококонверсионный лендинг для криптовалютного токена Ruble. Целью было четко представить концепцию проекта, его преимущества и призыв к действию. Сайт отличается отзывчивым дизайном, анимациями на чистом JavaScript и оптимизирован для поисковых систем, что способствует эффективному привлечению инвесторов и пользователей."
  },
  "jesko": {
    "title": "Jesko VPN",
    "description": "Спроектировал и запустил полноценный Telegram-бот для продажи VPN-доступа через Outline. Система автоматически создает и конфигурирует VPN-ключи для разных устройств и стран. Реализованы мультивалютные платежи (вкл. криптовалюты), реферальная программа, розыгрыши подписок и мощная админ-панель для управления пользователями и финансами на базе FastAPI и PostgreSQL."
  },
  "neurobot": {
    "title": "NeuronAgent",
    "description": "Создал многофункционального Telegram-бота для работы с нейросетями OpenAI и Midjourney. Бот общается с пользователями голосовыми сообщениями (преобразует речь в текст и обратно), генерирует изображения по запросам и работает по модели подписки. Внедрена реферальная система и админ-панель для анализа статистики и управления контентом."
  },
  "mori": {
    "title": "MORI SWAP",
    "description": "Разработал одностраничное приложение (SPA) для бесшовного бриджинга USDT из сети TON в мемкойны экосистемы Solana (Mori). Для обеспечения лучшего курса и ликвидности интеграция проведена с двумя мостами: Rhino.fi и Jupiter AG. Интерфейс на React интуитивно понятен и безопасно взаимодействует с кошельками пользователей через Web3."
  },
  "style": {
    "title": "STYLE.RF",
    "description": "Полностью реализовал бьюти-блог с системой управления контентом (CMS). Платформа включает личные кабинеты пользователей, комментирование с лайками/дизлайками, функционал репостов, интеграцию с почтой для уведомлений (NodeMailer) и продвижение брендов. Админ-панель позволяет легко управлять статьями, новостями и пользовательским взаимодействием."
  },
  "github": {
    "title": "GitHub"
  },
  "vk": {
    "title": "VK"
  },
  "telegram": {
    "title": "Telegram"
  },
  "linkedin": {
    "title": "LinkedIn"
  },
  "kaggle": {
    "title": "Kaggle"
  },
  "kwork": {
    "title": "Kwork"
  },
  "prices": {
    "hour": "час",
    "hours": "часов",
    "fullstack_dev_header": { "title": "Fullstack разработка" },
    "fullstack_1": { "title": "Пакет на 50 часов" },
    "fullstack_2": { "title": "Пакет на 100 часов" },
    "backend_dev_header": { "title": "Backend разработка" },
    "backend_1": { "title": "Пакет на 50 часов" },
    "backend_2": { "title": "Пакет на 100 часов" },
    "frontend_dev_header": { "title": "Frontend разработка" },
    "frontend_1": { "title": "Пакет на 50 часов" },
    "frontend_2": { "title": "Пакет на 100 часов" },
    "telegram_bots_header": { "title": "Telegram Bots (Aiogram)" },
    "telegram_bots_1": { "title": "Пакет на 30 часов" },
    "telegram_bots_2": { "title": "Пакет на 50 часов" },
    "telegram_mini_app_header": { "title": "Telegram Mini App (TMA)" },
    "telegram_mini_app_1": { "title": "Пакет на 50 часов" },
    "telegram_mini_app_2": { "title": "Пакет на 100 часов" },
    "devops_header": { "title": "DevOps" },
    "devops_1": { "title": "Пакет на 20 часов" },
    "devops_2": { "title": "Пакет на 50 часов" },
    "security_header": { "title": "Security (Аудит/Внедрение)" },
    "security_1": { "title": "Пакет на 20 часов" },
    "security_2": { "title": "Пакет на 50 часов" },
    "smart_contracts_header": { "title": "Smart Contracts" },
    "smart_contracts_1": { "title": "Пакет на 30 часов" },
    "smart_contracts_2": { "title": "Пакет на 80 часов" },
    "datascience_header": { "title": "DataScience / Machine Learning" },
    "datascience_1": { "title": "Пакет на 40 часов" },
    "datascience_2": { "title": "Пакет на 100 часов" }
  }
}
